import { tranLrc } from '../utils/util'
const songListState = [
    {
        title: '安和桥',
        author: '宋冬野',
        hash: 'f223a2080dcb9b0a427d2de2ce04796a',
        img: 'http://singerimg.kugou.com/uploadpic/softhead/400/20150309/20150309124337795580.jpg',
        url: 'http://fs.w.kugou.com/201804301554/e55b5d0d3e9f7eb4a747977d8a3f4019/G003/M01/18/17/o4YBAFUG_oiAXtxyAD1JyzTgRHo685.mp3',
        album: '未知专辑',
        lrc: tranLrc(`[00:00.11]宋冬野 - 安和桥
        [00:01.67]词：宋冬野
        [00:01.86]曲：宋冬野
        [00:02.66]编曲：韦伟
        [00:38.18]让我再看你一遍从南到北
        [00:44.64]像是被五环路蒙住的双眼
        [00:52.92]请你再讲一遍关于那天
        [00:59.51]抱着盒子的姑娘和擦汗的男人
        [01:06.82]我知道那些夏天
        [01:10.44]就像青春一样回不来
        [01:14.08]代替梦想的也只能是勉为其难
        [01:21.63]我知道吹过的牛逼
        [01:24.75]也会随青春一笑了之
        [01:28.93]让我困在城市里纪念你
        [01:37.30]让我再尝一口秋天的酒
        [01:43.80]一直往南方开不会太久
        [01:52.07]让我再听一遍最美的那一句
        [01:58.46]你回家了我在等你呢
        [02:35.43]我知道那些夏天
        [02:38.92]就像青春一样回不来
        [02:42.67]代替梦想的也只能是勉为其难
        [02:50.26]我知道吹过的牛逼
        [02:53.30]也会随青春一笑了之
        [02:57.44]让我困在城市里 纪念你
        [03:04.99]我知道那些夏天
        [03:08.51]就像你一样回不来
        [03:12.30]我也不会再对谁满怀期待
        [03:19.73]我知道这个世界
        [03:23.34]每天都有太多遗憾
        [03:26.98]所以你好再见
        `)
    },
    {
        title: '告白气球 (原版伴奏)',
        author: '周杰伦',
        hash: 'e5e19490a9f4fa9a5d47aeb47038113c',
        img: 'http://singerimg.kugou.com/uploadpic/softhead/400/20180117/20180117191408898.jpg',
        url: 'http://fs.w.kugou.com/201804301927/337e6145e8ea9f3ab547d73ffc5ded44/G083/M01/09/13/84YBAFgrPWOAcVdpADWL7QKVQLU102.mp3',
        album: '未知专辑',
        lrc: tranLrc(`[00:03.17]周杰伦 - 告白气球
        [00:04.69]作词：方文山
        [00:05.86]作曲：周杰伦
        [00:26.60]塞纳河畔 左岸的咖啡
        [00:29.35]我手一杯 品尝你的美
        [00:32.52]留下唇印的嘴
        [00:37.30]花店玫瑰 名字写错谁
        [00:39.94]告白气球 风吹到对街
        [00:43.11]微笑在天上飞
        [00:47.11]你说你有点难追 想让我知难而退
        [00:52.28]礼物不需挑最贵 只要香榭的落叶
        [00:57.81]喔 营造浪漫的约会
        [01:00.28]不害怕搞砸一切
        [01:02.86]拥有你就拥有 全世界
        [01:08.13]亲爱的 爱上你 从那天起
        [01:14.17]甜蜜的很轻易
        [01:18.84]亲爱的 别任性 你的眼睛
        [01:25.02]在说我愿意
        [01:52.00]塞纳河畔 左岸的咖啡
        [01:54.59]我手一杯 品尝你的美
        [01:57.76]留下唇印的嘴
        [02:02.65]花店玫瑰 名字写错谁
        [02:05.38]告白气球 风吹到对街
        [02:08.43]微笑在天上飞
        [02:12.54]你说你有点难追
        [02:14.87]想让我知难而退
        [02:17.55]礼物不需挑最贵
        [02:20.52]只要香榭的落叶
        [02:22.82]喔 营造浪漫的约会
        [02:25.61]不害怕搞砸一切
        [02:28.25]拥有你就拥有 全世界
        [02:33.13]亲爱的 爱上你 从那天起
        [02:39.53]甜蜜的很轻易
        [02:43.83]亲爱的 别任性 你的眼睛
        [02:50.32]在说我愿意
        [02:54.57]亲爱的 爱上你 恋爱日记
        [03:00.95]飘香水的回忆
        [03:05.26]一整瓶 的梦境 全都有你
        [03:11.70]搅拌在一起
        [03:15.99]亲爱的别任性 你的眼睛
        [03:24.25]在说我愿意
        `)
    },
    {
        title: '广东爱情故事',
        author: '广东雨神',
        hash: '2a25aaff4b6c84b859b4d77f944de57a',
        img: 'http://singerimg.kugou.com/uploadpic/softhead/400/20171222/20171222112942494.jpg',
        url: 'http://fs.w.kugou.com/201804301905/7b8f245d860d024f64d3952ebf3d73ae/G114/M0B/00/13/UpQEAFnocumANGxzADRUF4h4Zks442.mp3',
        album: '未知专辑',
        lrc: tranLrc(`[00:00.03]广东雨神 - 广东爱情故事
    [00:02.61]词：广东雨神
    [00:03.83]曲：广东雨神
    [00:18.87]安静地离去
    [00:21.66]和孤单一起
    [00:26.47]拥挤的回忆时间抹去
    [00:33.26]人在广东已经漂泊十年
    [00:36.32]有时也怀念当初一起
    [00:38.41]经已改变
    [00:40.88]让这天空将你我相连
    [00:44.00]怀念你走了云的天空还任性
    [00:51.48]是否它相信在乎
    [00:53.10]反而容易放弃
    [00:55.92]非要最后一无所有
    [00:59.01]才无所畏惧
    [01:08.94]我知道好多时候
    [01:11.88]爱一个人是没任何理由的
    [01:15.92]你同其他女子不一样的
    [01:18.54]你从来都不问我钟意你什么
    [01:21.49]反而我成日都问你
    [01:24.96]你究竟钟意我什么
    [01:33.79]笑的多一些改变要彻底
    [01:41.34]直面这世界真假游戏
    [01:48.24]人在广东已经漂泊十年
    [01:51.34]有时也怀念当初一起
    [01:53.55]经已改变
    [01:55.81]让这天空将你我相连
    [01:59.23]怀念你走了云的天空还任性
    [02:06.41]是否它相信下一次的相遇
    [02:10.83]就算最后一无所有
    [02:13.83]也无所畏惧
    [02:18.78]相信你就如当初一起
    [02:22.24]行过广东这十年幸福走了
    [02:28.14]唏嘘感慨那当初
    [02:33.76]相信你哪怕坚强
    [02:36.44]是假装出勇敢的面具
    [02:41.33]也不能少活得精彩的勇气
    [02:48.34]人在广东已经漂泊十年
    [02:51.30]有时也怀念当初一起
    [02:53.48]经已改变
    [02:55.83]让这天空将你我相连
    [02:59.22]怀念你走了云的天空
    [03:04.72]还任性是否它相信
    [03:07.50]下一次的相遇
    [03:10.84]就算最后一无所有
    [03:13.78]也无所畏惧
    [03:18.50]就算最后一无所有
    [03:21.08]我都无所畏惧`)
    },
    {
        title: '像我这样的人',
        author: '玄子',
        hash: '9d04999dd282131e6fcb6b47d301cd5d',
        img: 'http://singerimg.kugou.com/uploadpic/softhead/400/20180123/20180123175221168.jpg',
        url: 'http://fs.w.kugou.com/201804301931/599d1743371da2965ee71020b9f7f066/G107/M09/0D/01/qw0DAFoFvveAYVUcACqlQwSXElI189.mp3',
        album: '未知专辑',
        lrc: tranLrc(`[00:00.23]玄子 - 像我这样的人
        [00:01.69]作词：毛不易
        [00:02.66]作曲：毛不易
        [00:17.28]像我这样优秀的人
        [00:21.38]本该灿烂过一生
        [00:25.08]怎么二十多年到头来
        [00:28.83]还在人海里浮沉
        [00:32.77]像我这样聪明的人
        [00:36.68]早就告别了单纯
        [00:40.53]怎么还是用了一段情
        [00:44.38]去换一身伤痕
        [00:48.17]像我这样迷茫的人
        [00:51.77]像我这样寻找的人
        [00:55.87]像我这样碌碌无为的人
        [00:59.82]你还见过多少人
        [01:22.99]像我这样庸俗的人
        [01:26.95]从不喜欢装深沉
        [01:30.79]怎么偶尔听到老歌时
        [01:34.84]忽然也晃了神
        [01:38.49]像我这样懦弱的人
        [01:42.07]凡事都要留几分
        [01:46.32]怎么曾经也会为了谁
        [01:50.12]想过奋不顾身
        [01:53.91]像我这样迷茫的人
        [01:57.91]像我这样寻找的人
        [02:01.61]像我这样碌碌无为的人
        [02:05.60]你还见过多少人
        [02:09.39]像我这样孤单的人
        [02:13.24]像我这样傻的人
        [02:17.14]像我这样不甘平凡的人
        [02:21.14]世界上有多少人
        [02:26.91]像我这样莫名其妙的人
        [02:31.21]会不会有人心疼
        `)
    }
]

const songList = (state = songListState, action) => {      
    switch (action.type) {
        case 'DEL_SONG':
            let oldState = [...state]
            let i = -1
            oldState.forEach((el, index) => {
                if (el.hash === action.song.hash) {
                    i = index
                }
            })
            oldState.splice(i, 1)
            return oldState
        case 'ADD_SONG':
            let isExt = state.some(el => {
                return el.hash === action.curSong.hash 
            })
            let nSong = [...state]
            if (!isExt) {
                nSong = [...nSong, action.curSong]
            }
            return nSong
        default:
            return state
    }
}

export default songList